source/3-3-2-conv_num_bases.org
#+STARTUP:indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
#+OPTIONS: f:nil author:nil num:1 creator:nil timestamp:nil 
#+TITLE: 3.3.2 Converting Between Number Bases
#+AUTHOR: Steve Fone

#+BEGIN_HTML
<div class=ribbon>
<a href="GITHUB URL HERE">Fork me on GitHub</a>
</div>
#+END_HTML
* COMMENT Use as a template
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:

** Design It
:PROPERTIES:
:HTML_CONTAINER_CLASS: design
:END:

** Build It
:PROPERTIES:
:HTML_CONTAINER_CLASS: build
:END:

** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:

** Run It
:PROPERTIES:
:HTML_CONTAINER_CLASS: run
:END:

** Document It
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:

** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:

** Program It
:PROPERTIES:
:HTML_CONTAINER_CLASS: program
:END:

** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

** Save It
:PROPERTIES:
:HTML_CONTAINER_CLASS: save
:END:

* Converting Between Number Bases
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
*Converting Between Number Bases*
- Different numbering systems exist for whole numbers, fractions,
  positive numbers and negative numbers. At GCSE level, you need only
  work with binary integers that have a decimal equivalent of between
  0 and 255.

*Binary to Decimal Conversion*
- To convert a binary number into decimal, add up the column values
  where a =1= appears.
- For example, to convert the binary number =01101100= to decimal,
  write each number under a column heading, starting on the right with
  the least significant digit:

|   *2^7*  |  *2^6*   |  *2^5*   |  *2^4*  |  *2^3*   |  *2^2*  |  *2^1*  |  *2^0*  |
|----------+----------+----------+---------+----------+---------+---------+---------|
|   *128*  |   *64*   |   *32*   |  *16*   |    *8*   |   *4*   |   *2*   |   *1*   |
|----------+----------+----------+---------+----------+---------+---------+---------|
|0         |1         |1         |0        |1         |1        |0        |0        |

- =This gives us the value: 64 + 32 + 8 + 4 = 108=

*More Examples:*

                                                                                                   
|--------------------------------------------------------------------------------------------------|
|  *Decimal*   |   *128*  |   *64*   |   *32*   |  *16*   |    *8*   |   *4*   |   *2*   |   *1*   |
|--------------+----------+----------+----------+---------+----------+---------+---------+---------|
|  *126*  <--- |0         |1         |1         |1        |1         |1        |1        |0        |
|--------------+----------+----------+----------+---------+----------+---------+---------+---------|
|  *213*  <--- |1         |1         |0         |1        |0         |1        |0        |1        |
|--------------+----------+----------+----------+---------+----------+---------+---------+---------|
|  *255*  <--- |1         |1         |1         |1        |1         |1        |1        |1        |


** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

*Binary Game*
- Try playing the binary game using the link below:
#+BEGIN_html
<iframe width="700" height="600" src="https://games.penjee.com/binary-numbers-game/" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
#+END_html

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
- *Silver*: Convert the following binary numbers into decimal.
#+BEGIN_SRC
 1. 00010111
 2. 10010110
 3. 11111111
#+END_SRC

** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
