pages/3-3-2-conv_num_bases.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>3.3.2 Converting Between Number Bases</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">3.3.2 Converting Between Number Bases</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Converting Between Number Bases</a>
<ul>
<li><a href="#sec-1-1">Learn It</a></li>
<li><a href="#sec-1-2">Try It</a></li>
<li><a href="#sec-1-3">Badge It</a></li>
<li><a href="#sec-1-4">Learn It</a>
<ul>
<li><a href="#sec-1-4-1">Decimal to Binary Conversions</a></li>
</ul>
</li>
<li><a href="#sec-1-5">Badge It</a></li>
<li><a href="#sec-1-6">Learn It</a>
<ul>
<li><a href="#sec-1-6-1">Hexadecimal Number System</a></li>
</ul>
</li>
<li><a href="#sec-1-7">Learn It</a>
<ul>
<li><a href="#sec-1-7-1">Converting Binary/Decimal to Hexadecimal</a></li>
</ul>
</li>
<li><a href="#sec-1-8">Learn It</a>
<ul>
<li><a href="#sec-1-8-1">Converting Hexadecimal to Binary/Decimal</a></li>
</ul>
</li>
<li><a href="#sec-1-9">Badge It</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="GITHUB URL HERE">Fork me on GitHub</a>
</div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Converting Between Number Bases</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Converting Between Number Bases</b>
</p>
<ul class="org-ul">
<li>Different numbering systems exist for whole numbers, fractions,
positive numbers and negative numbers. At GCSE level, you need only
work with binary integers that have a decimal equivalent of between
0 and 255.
</li>
</ul>

<p>
<b>Binary to Decimal Conversion</b>
</p>
<ul class="org-ul">
<li>To convert a binary number into decimal, add up the column values
where a <code>1</code> appears.
</li>
<li>For example, to convert the binary number <code>01101100</code> to decimal,
write each number under a column heading, starting on the right with
the least significant digit:
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>2<sup>7</sup></b></th>
<th scope="col" class="left"><b>2<sup>6</sup></b></th>
<th scope="col" class="left"><b>2<sup>5</sup></b></th>
<th scope="col" class="left"><b>2<sup>4</sup></b></th>
<th scope="col" class="left"><b>2<sup>3</sup></b></th>
<th scope="col" class="left"><b>2<sup>2</sup></b></th>
<th scope="col" class="left"><b>2<sup>1</sup></b></th>
<th scope="col" class="left"><b>2<sup>0</sup></b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>128</b></td>
<td class="left"><b>64</b></td>
<td class="left"><b>32</b></td>
<td class="left"><b>16</b></td>
<td class="left"><b>8</b></td>
<td class="left"><b>4</b></td>
<td class="left"><b>2</b></td>
<td class="left"><b>1</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">0</td>
<td class="left">1</td>
<td class="left">1</td>
<td class="left">0</td>
<td class="left">1</td>
<td class="left">1</td>
<td class="left">0</td>
<td class="left">0</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><code>This gives us the value: 64 + 32 + 8 + 4 = 108</code>
</li>
</ul>

<p>
<b>More Examples:</b>
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>Decimal</b></th>
<th scope="col" class="right"><b>128</b></th>
<th scope="col" class="right"><b>64</b></th>
<th scope="col" class="right"><b>32</b></th>
<th scope="col" class="right"><b>16</b></th>
<th scope="col" class="right"><b>8</b></th>
<th scope="col" class="right"><b>4</b></th>
<th scope="col" class="right"><b>2</b></th>
<th scope="col" class="right"><b>1</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>126</b>  &lt;---</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>213</b>  &lt;---</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>255</b>  &lt;---</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3 try">
<h3 id="sec-1-2">Try It</h3>
<div class="outline-text-3" id="text-1-2">

<p>
<b>Binary Game</b>
</p>
<ul class="org-ul">
<li>Try playing the binary game using the link below:
</li>
</ul>
<iframe width="700" height="600" src="https://games.penjee.com/binary-numbers-game/" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3 badge">
<h3 id="sec-1-3">Badge It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><b>Silver</b>: Convert the following binary numbers into decimal.
</li>
</ul>
<pre class="example">
1. 00010111
2. 10010110
3. 11111111
</pre>
</div>
</div>
