source/3-3-2-conv_num_bases.org
*** Decimal to Binary Conversions
- To convert a decimal number to a binary number, use the column
  headings. You need to find the highest column heading that you can
  take away from the number and start there.
- To convert the decimal number =57= into binary.
- The highest column heading we can take out of 57 is 32 (The next one
  is 64, too high):
  1. We can start by placing a =1= in the column headed =32= (57 - 32 = 25).
  2. We can then place a =1= in the column headed 16 (25 - 16 = 9).
  3. Finally place =1s= in the columns =8= and =1= (9 - 8 = 1).

|----------+----------+----------+---------+----------+---------+---------+---------|
|   *128*  |   *64*   |   *32*   |  *16*   |    *8*   |   *4*   |   *2*   |   *1*   |
|----------+----------+----------+---------+----------+---------+---------+---------|
|     0    |    0     |     1    |    1    |     1    |    0    |    0    |    1    |

- *This gives us the value: 57 = 00111001*

*Here are some more examples:*
                                                                                                   
|--------------------------------------------------------------------------------------------------|
|  *Decimal*   |   *128*  |   *64*   |   *32*   |  *16*   |    *8*   |   *4*   |   *2*   |   *1*   |
|--------------+----------+----------+----------+---------+----------+---------+---------+---------|
|  *23*  --->  |0         |0         |0         |1        |0         |1        |1        |1        |
|--------------+----------+----------+----------+---------+----------+---------+---------+---------|
|  *84*  --->  |0         |1         |0         |1        |0         |1        |0        |0        |
|--------------+----------+----------+----------+---------+----------+---------+---------+---------|
|  *255* --->  |1         |1         |1         |1        |1         |1        |1        |1        |

- You will notice in the examples above that we always write the
  binary numbers using eight bits.
- This is common practise, it is not incorrect to write the first
  binary value as 10111 rather than 00010111 (Without the leading
  zeros), but the second example is more commonly used as values are
  often stored in bytes.

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
- *Gold*: Convert the following decimal numbers into binary.
#+BEGIN_SRC
 1. 19
 2. 63
 3. 142
#+END_SRC

** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
*** Hexadecimal Number System
- As mentioned previously, humans are not very good at remembering
  long strings of numbers. For example which of these are easier to
  remember: =0110111= or =6F=
- So to make it easier, we can represent every group of 4 bits
  (Nibble) with a single digit.
- The smallest value you can hold in 4 bits is =0000=. The largest
  value is =1111=. This means that we need to represent the decimal
  values 0 to 15 with a single digit.
- As we only have 10 single digits in decimal (0 to 9), so to get
  around this proble we use uppercase letters A to F for the remaining six digits.
- The following table shows the hexadecimal digits and their decimal equivalents:

|*Decimal*     |0 |1 |2 |3 |4 |5 |6 |7 |8 |9 |10|11|12|13|14|15|
|--------------+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--|
|*Hexadecimal* |0 |1 |2 |3 |4 |5 |6 |7 |8 |9 |A |B |C |D |E |F |

*Useful Conversion Table*
|*Decimal*| *Binary*  |*Hexadecimal*|
|---------+-----------+-------------|
|0        |0000       |0            | 
|---------------------+-------------| 
|1        |0001       |1            |
|---------+-----------+-------------|
|2        |0010       |2            |
|---------+-----------+-------------|
|3        |0011       |3            |
|---------+-----------+-------------|
|4        |0100       |4            |
|---------+-----------+-------------|
|5        |0101       |5            |
|---------+-----------+-------------|
|6        |0110       |6            |
|---------+-----------+-------------|
|7        |0111       |7            |
|---------+-----------+-------------|
|8        |1000       |8            |
|---------+-----------+-------------|
|9        |1001       |9            |
|---------+-----------+-------------|
|10       |1010       |A            |
|---------+-----------+-------------|
|11       |1011       |B            |
|---------+-----------+-------------|
|12       |1100       |C            |
|---------+-----------+-------------|
|13       |1101       |D            |
|---------+-----------+-------------|
|14       |1110       |E            |
|---------+-----------+-------------|
|15       |1111       |F            |
|---------+-----------|-------------|
|16       |0001 0000  |10           |
|---------+-----------+-------------|
|255      |1111 1111  |FF           |


*Note for above table*
- *Decimal Number 15* - A single digit replaces 4 bits, 15 is the biggest number you can have with 4 bits.
- *Decimal Number 16* - So 16 is one group of 16 and no units.
- *Decimal Number 255* - 255 is 15 groups of 16 + 15 units i.e. ((15 x 16) + 15 = 240 + 15).

*Hexadecimal Explained*
- The following video explains how hexadecimal number systems work.
#+BEGIN_html
<iframe width="560" height="315" src="https://www.youtube.com/embed/5sS7w-CMHkU" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
#+END_html

** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
