pages/3-3-2-conv_num_bases.html

<div id="outline-container-sec-1-4" class="outline-3 learn">
<h3 id="sec-1-4">Learn It</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">Decimal to Binary Conversions</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>To convert a decimal number to a binary number, use the column
headings. You need to find the highest column heading that you can
take away from the number and start there.
</li>
<li>To convert the decimal number <code>57</code> into binary.
</li>
<li>The highest column heading we can take out of 57 is 32 (The next one
is 64, too high):
<ol class="org-ol">
<li>We can start by placing a <code>1</code> in the column headed <code>32</code> (57 - 32 = 25).
</li>
<li>We can then place a <code>1</code> in the column headed 16 (25 - 16 = 9).
</li>
<li>Finally place <code>1s</code> in the columns <code>8</code> and <code>1</code> (9 - 8 = 1).
</li>
</ol>
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right"><b>128</b></th>
<th scope="col" class="right"><b>64</b></th>
<th scope="col" class="right"><b>32</b></th>
<th scope="col" class="right"><b>16</b></th>
<th scope="col" class="right"><b>8</b></th>
<th scope="col" class="right"><b>4</b></th>
<th scope="col" class="right"><b>2</b></th>
<th scope="col" class="right"><b>1</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><b>This gives us the value: 57 = 00111001</b>
</li>
</ul>

<p>
<b>Here are some more examples:</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>Decimal</b></th>
<th scope="col" class="right"><b>128</b></th>
<th scope="col" class="right"><b>64</b></th>
<th scope="col" class="right"><b>32</b></th>
<th scope="col" class="right"><b>16</b></th>
<th scope="col" class="right"><b>8</b></th>
<th scope="col" class="right"><b>4</b></th>
<th scope="col" class="right"><b>2</b></th>
<th scope="col" class="right"><b>1</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>23</b>  &#x2014;&gt;</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>84</b>  &#x2014;&gt;</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>255</b> &#x2014;&gt;</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>You will notice in the examples above that we always write the
binary numbers using eight bits.
</li>
<li>This is common practise, it is not incorrect to write the first
binary value as 10111 rather than 00010111 (Without the leading
zeros), but the second example is more commonly used as values are
often stored in bytes.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3 badge">
<h3 id="sec-1-5">Badge It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><b>Gold</b>: Convert the following decimal numbers into binary.
</li>
</ul>
<pre class="example">
1. 19
2. 63
3. 142
</pre>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3 learn">
<h3 id="sec-1-6">Learn It</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">Hexadecimal Number System</h4>
<div class="outline-text-4" id="text-1-6-1">
<ul class="org-ul">
<li>As mentioned previously, humans are not very good at remembering
long strings of numbers. For example which of these are easier to
remember: <code>0110111</code> or <code>6F</code>
</li>
<li>So to make it easier, we can represent every group of 4 bits
(Nibble) with a single digit.
</li>
<li>The smallest value you can hold in 4 bits is <code>0000</code>. The largest
value is <code>1111</code>. This means that we need to represent the decimal
values 0 to 15 with a single digit.
</li>
<li>As we only have 10 single digits in decimal (0 to 9), so to get
around this proble we use uppercase letters A to F for the remaining six digits.
</li>
<li>The following table shows the hexadecimal digits and their decimal equivalents:
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>Decimal</b></th>
<th scope="col" class="right">0</th>
<th scope="col" class="right">1</th>
<th scope="col" class="right">2</th>
<th scope="col" class="right">3</th>
<th scope="col" class="right">4</th>
<th scope="col" class="right">5</th>
<th scope="col" class="right">6</th>
<th scope="col" class="right">7</th>
<th scope="col" class="right">8</th>
<th scope="col" class="right">9</th>
<th scope="col" class="right">10</th>
<th scope="col" class="right">11</th>
<th scope="col" class="right">12</th>
<th scope="col" class="right">13</th>
<th scope="col" class="right">14</th>
<th scope="col" class="right">15</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>Hexadecimal</b></td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">2</td>
<td class="right">3</td>
<td class="right">4</td>
<td class="right">5</td>
<td class="right">6</td>
<td class="right">7</td>
<td class="right">8</td>
<td class="right">9</td>
<td class="right">A</td>
<td class="right">B</td>
<td class="right">C</td>
<td class="right">D</td>
<td class="right">E</td>
<td class="right">F</td>
</tr>
</tbody>
</table>

<p>
<b>Useful Conversion Table</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right"><b>Decimal</b></th>
<th scope="col" class="right"><b>Binary</b></th>
<th scope="col" class="right"><b>Hexadecimal</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">0</td>
<td class="right">0000</td>
<td class="right">0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">1</td>
<td class="right">0001</td>
<td class="right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">2</td>
<td class="right">0010</td>
<td class="right">2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">3</td>
<td class="right">0011</td>
<td class="right">3</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">4</td>
<td class="right">0100</td>
<td class="right">4</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">5</td>
<td class="right">0101</td>
<td class="right">5</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">6</td>
<td class="right">0110</td>
<td class="right">6</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">7</td>
<td class="right">0111</td>
<td class="right">7</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">8</td>
<td class="right">1000</td>
<td class="right">8</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">9</td>
<td class="right">1001</td>
<td class="right">9</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">10</td>
<td class="right">1010</td>
<td class="right">A</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">11</td>
<td class="right">1011</td>
<td class="right">B</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">12</td>
<td class="right">1100</td>
<td class="right">C</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">13</td>
<td class="right">1101</td>
<td class="right">D</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">14</td>
<td class="right">1110</td>
<td class="right">E</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">15</td>
<td class="right">1111</td>
<td class="right">F</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">16</td>
<td class="right">0001 0000</td>
<td class="right">10</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">255</td>
<td class="right">1111 1111</td>
<td class="right">FF</td>
</tr>
</tbody>
</table>


<p>
<b>Note for above table</b>
</p>
<ul class="org-ul">
<li><b>Decimal Number 15</b> - A single digit replaces 4 bits, 15 is the biggest number you can have with 4 bits.
</li>
<li><b>Decimal Number 16</b> - So 16 is one group of 16 and no units.
</li>
<li><b>Decimal Number 255</b> - 255 is 15 groups of 16 + 15 units i.e. ((15 x 16) + 15 = 240 + 15).
</li>
</ul>

<p>
<b>Hexadecimal Explained</b>
</p>
<ul class="org-ul">
<li>The following video explains how hexadecimal number systems work.
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/5sS7w-CMHkU" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>
</div>
