source/3-3-2-conv_num_bases.org
*** Converting Binary/Decimal to Hexadecimal
- In GCSE computing you will only need to work with 8-bit binary
  numbers, which can be represented as two hex digits.
- The left-hand hex digit represents groups of 16, the right-hand hex
  digits represents the units.
- For example, to convert
- There are several methods for converting Decimal to Hexadecimal:
- *Method 1: Convert to Binary/Hex*
- Using the tables and video above try and convert the following decimal
  number: =112= first into Binary and then into Hexadecimal?
- *Step 1*: First we need to use the *binary table* to work out the
  Binary number.
- *Step 2*: Does 128 go into 112? No, so we place a 0 under the 128
  value, then does 64 go into 112? Yes, 112 - 64 = 48 - so we place a 1
  under the 64 value.
- *Step 3*: We can then check does 32 goes into 48? Yes, 48 - 32 =
  16 - so we place a 1 under the 32 value.
- *Step 4*: Repeat this until there is no remainder.

|   *2^7*  |  *2^6*   |  *2^5*   |  *2^4*  |  *2^3*   |  *2^2*  |  *2^1*  |  *2^0*  |
|----------+----------+----------+---------+----------+---------+---------+---------|
|   *128*  |   *64*   |   *32*   |  *16*   |    *8*   |   *4*   |   *2*   |   *1*   |
|----------+----------+----------+---------+----------+---------+---------+---------|
|0         |1         |1         |1        |0         |0        |0        |0        |

- This gives us 01110000 - We then need to split the byte (8 bits) into
  two nibbles (4 bits).
- Then starting at the least significant bit (The right side).
- Read the 4 bits (0000) - Look at the conversion table above gives us
  a =0=.
- Read the next 4 bits (0111) - Again look at the coversion table
  gives us a =7=.
- So =112= in Decimal converts to =01110000= in Binary - Converts to
  *70* in Hexadecimal.

- *Method 2: Divide by 16*
- To convert the decimal number =182= into hex the first step is to
  work out how many groups of 16 there are in 182.
- Secondly work out how many units are left over.
- =182 / 16 = 11 remainder 6=
- =11= is =B= in hex, =6= is just =6=, so =182= in decimal = =B6= hex.

- *Method 3: Denary as a Middle Step*
- With experience, you'll not need a table, as you'll come to recognise the hex equivalent for each nibble.
- However, if you don't have a conversion table or can't remember the values, you can convert between binary and hex, by using denary as a middle step.
- Lets start with the binary number =01011101=
- Split it into nibbles - =0101 1101=
- Convert to denary - =1*1 + 0*2 + 1*4 + 0*8= and = =1*1 + 0*2 + 1*4 + 1*8=
- So we get - =5= and =13=
- Now convert to Hex - =5= and =D=
- So the Hex is 5D

** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
*** Converting Hexadecimal to Binary/Decimal
*Converting Hexadecimal to Binary*
- Converting a hexadecimal number into binary is a simple matter of
  converting each hex digit into a group of 4 binary digits. To convert the hex number *A7* to binary:
- Use the Binary Conversion table above to look at the four left-hand
  binary digits that represent the hex number *A* ---> *1010* and then
  look at the next four binary digits that represent the hex number
  =7 ---> 0111=.
- So the hex number =A7= can be represented by the binary value
  =10100111=

*More Examples:*
- =B5 ---> 1011 0101=
- =FA ---> 1111 1010=

*Converting Hexadecimal to Decimal*
- To convert a hexadeicmal number into decimal, multiply the heading
  or place value by the hex digit value, to convert the hex number
  =A7= to decimal. (Remember column place values are: 16 and 1, and A
  = 10)
- *A* = (10 x 16) + *7* = (7 x 1) = *167*

*More Examples:*
- *7F* ---> *112* + *15* = *127*
- *CD* ---> *192* + *13* = *205*

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
- *Platinum*: Conplete the following conversions:
#+BEGIN_SRC
Convert the following numbers from binary to hex:
 1. 00010111
 2. 11111100
 3. 00110010
 4. 11011100
#+END_SRC
#+BEGIN_SRC
Convert the following numbers from decimal to hex:
 1. 77
 2. 255
 3. 186
 4. 18
#+END_SRC
#+BEGIN_SRC
Convert the following hexadecimal numbers into binary:
 1. E4
 2. 8A
 3. FF
 4. C1
#+END_SRC
#+BEGIN_SRC
Convert the following hexadecimal numbers into decimal:
 1. 77
 2. AF
 3. 17
 4. 20
#+END_SRC

*Uses of hexadecimal* 
- Hex numbers are expressed more compactly than binary numbers, and are much easier to understand and remember.
- For this reason, hexadecimal numbers are often used instead of binary numbers and have several applications in computing.
- One application you are probably familiar with is picking colours for a graphic.
- Hex numbers are also used in assembly language instructions such as ADD &4F3A.
