pages/3-3-2-conv_num_bases.html

<div id="outline-container-sec-1-7" class="outline-3 learn">
<h3 id="sec-1-7">Learn It</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1">Converting Binary/Decimal to Hexadecimal</h4>
<div class="outline-text-4" id="text-1-7-1">
<ul class="org-ul">
<li>In GCSE computing you will only need to work with 8-bit binary
numbers, which can be represented as two hex digits.
</li>
<li>The left-hand hex digit represents groups of 16, the right-hand hex
digits represents the units.
</li>
<li>For example, to convert
</li>
<li>There are several methods for converting Decimal to Hexadecimal:
</li>
<li><b>Method 1: Convert to Binary/Hex</b>
</li>
<li>Using the tables and video above try and convert the following decimal
number: <code>112</code> first into Binary and then into Hexadecimal?
</li>
<li><b>Step 1</b>: First we need to use the <b>binary table</b> to work out the
Binary number.
</li>
<li><b>Step 2</b>: Does 128 go into 112? No, so we place a 0 under the 128
value, then does 64 go into 112? Yes, 112 - 64 = 48 - so we place a 1
under the 64 value.
</li>
<li><b>Step 3</b>: We can then check does 32 goes into 48? Yes, 48 - 32 =
16 - so we place a 1 under the 32 value.
</li>
<li><b>Step 4</b>: Repeat this until there is no remainder.
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>2<sup>7</sup></b></th>
<th scope="col" class="left"><b>2<sup>6</sup></b></th>
<th scope="col" class="left"><b>2<sup>5</sup></b></th>
<th scope="col" class="left"><b>2<sup>4</sup></b></th>
<th scope="col" class="left"><b>2<sup>3</sup></b></th>
<th scope="col" class="left"><b>2<sup>2</sup></b></th>
<th scope="col" class="left"><b>2<sup>1</sup></b></th>
<th scope="col" class="left"><b>2<sup>0</sup></b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>128</b></td>
<td class="left"><b>64</b></td>
<td class="left"><b>32</b></td>
<td class="left"><b>16</b></td>
<td class="left"><b>8</b></td>
<td class="left"><b>4</b></td>
<td class="left"><b>2</b></td>
<td class="left"><b>1</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">0</td>
<td class="left">1</td>
<td class="left">1</td>
<td class="left">1</td>
<td class="left">0</td>
<td class="left">0</td>
<td class="left">0</td>
<td class="left">0</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>This gives us 01110000 - We then need to split the byte (8 bits) into
two nibbles (4 bits).
</li>
<li>Then starting at the least significant bit (The right side).
</li>
<li>Read the 4 bits (0000) - Look at the conversion table above gives us
a <code>0</code>.
</li>
<li>Read the next 4 bits (0111) - Again look at the coversion table
gives us a <code>7</code>.
</li>
<li>So <code>112</code> in Decimal converts to <code>01110000</code> in Binary - Converts to
<b>70</b> in Hexadecimal.
</li>

<li><b>Method 2: Divide by 16</b>
</li>
<li>To convert the decimal number <code>182</code> into hex the first step is to
work out how many groups of 16 there are in 182.
</li>
<li>Secondly work out how many units are left over.
</li>
<li><code>182 / 16 = 11 remainder 6</code>
</li>
<li><code>11</code> is <code>B</code> in hex, <code>6</code> is just <code>6</code>, so <code>182</code> in decimal = <code>B6</code> hex.
</li>

<li><b>Method 3: Denary as a Middle Step</b>
</li>
<li>With experience, you'll not need a table, as you'll come to recognise the hex equivalent for each nibble.
</li>
<li>However, if you don't have a conversion table or can't remember the values, you can convert between binary and hex, by using denary as a middle step.
</li>
<li>Lets start with the binary number <code>01011101</code>
</li>
<li>Split it into nibbles - <code>0101 1101</code>
</li>
<li>Convert to denary - <code>1*1 + 0*2 + 1*4 + 0*8</code> and = <code>1*1 + 0*2 + 1*4 + 1*8</code>
</li>
<li>So we get - <code>5</code> and <code>13</code>
</li>
<li>Now convert to Hex - <code>5</code> and <code>D</code>
</li>
<li>So the Hex is 5D
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3 learn">
<h3 id="sec-1-8">Learn It</h3>
<div class="outline-text-3" id="text-1-8">
</div>
<div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1">Converting Hexadecimal to Binary/Decimal</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
<b>Converting Hexadecimal to Binary</b>
</p>
<ul class="org-ul">
<li>Converting a hexadecimal number into binary is a simple matter of
converting each hex digit into a group of 4 binary digits. To convert the hex number <b>A7</b> to binary:
</li>
<li>Use the Binary Conversion table above to look at the four left-hand
binary digits that represent the hex number <b>A</b> &#x2014;&gt; <b>1010</b> and then
look at the next four binary digits that represent the hex number
<code>7 ---&gt; 0111</code>.
</li>
<li>So the hex number <code>A7</code> can be represented by the binary value
<code>10100111</code>
</li>
</ul>

<p>
<b>More Examples:</b>
</p>
<ul class="org-ul">
<li><code>B5 ---&gt; 1011 0101</code>
</li>
<li><code>FA ---&gt; 1111 1010</code>
</li>
</ul>

<p>
<b>Converting Hexadecimal to Decimal</b>
</p>
<ul class="org-ul">
<li>To convert a hexadeicmal number into decimal, multiply the heading
or place value by the hex digit value, to convert the hex number
<code>A7</code> to decimal. (Remember column place values are: 16 and 1, and A
= 10)
</li>
<li><b>A</b> = (10 x 16) + <b>7</b> = (7 x 1) = <b>167</b>
</li>
</ul>

<p>
<b>More Examples:</b>
</p>
<ul class="org-ul">
<li><b>7F</b> &#x2014;&gt; <b>112</b> + <b>15</b> = <b>127</b>
</li>
<li><b>CD</b> &#x2014;&gt; <b>192</b> + <b>13</b> = <b>205</b>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3 badge">
<h3 id="sec-1-9">Badge It</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li><b>Platinum</b>: Conplete the following conversions:
</li>
</ul>
<pre class="example">
Convert the following numbers from binary to hex:
 1. 00010111
 2. 11111100
 3. 00110010
 4. 11011100
</pre>
<pre class="example">
Convert the following numbers from decimal to hex:
 1. 77
 2. 255
 3. 186
 4. 18
</pre>
<pre class="example">
Convert the following hexadecimal numbers into binary:
 1. E4
 2. 8A
 3. FF
 4. C1
</pre>
<pre class="example">
Convert the following hexadecimal numbers into decimal:
 1. 77
 2. AF
 3. 17
 4. 20
</pre>

<p>
<b>Uses of hexadecimal</b> 
</p>
<ul class="org-ul">
<li>Hex numbers are expressed more compactly than binary numbers, and are much easier to understand and remember.
</li>
<li>For this reason, hexadecimal numbers are often used instead of binary numbers and have several applications in computing.
</li>
<li>One application you are probably familiar with is picking colours for a graphic.
</li>
<li>Hex numbers are also used in assembly language instructions such as ADD &amp;4F3A.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>